app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.order("expiry").all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY expiry  [["user_id", nil]]

    task = current_user.tasks.create( task_create_params)
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "expiry", "importance") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "paint"], ["description", "web version"], ["created_at", "2017-12-02 20:56:33.511258"], ["updated_at", "2017-12-02 20:56:33.511258"], ["expiry", "2017-12-02 00:00:00"], ["importance", 5]]

    task = current_user.tasks.find_by(id: params[:id])
    if task && params[:task]
      task.update!(task_update_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", "5e0d6ade-2487-4d6f-b2dc-17f78c2265b1"], ["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "updated task"], ["description", "updated task"], ["updated_at", "2017-12-13 09:04:41.606830"], ["id", 15]]

    task = current_user.tasks.find_by(id: params[:id])
    if task
      task.destroy!
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", "4ca12cb5-ebfc-4c18-810a-b7c4594c1a01"], ["id", 38], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 38]]